In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
animals=DataFrame(np.arange(16).reshape(4,4), columns=['W', 'X', 'Y', 'z'], index=['Dog','Cat','Bird', 'Mouse'])

In [4]:
animals

        W   X   Y   z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [10]:
behavior_map={'W':'good', 'X':'bad','Y':'good','Z':'bad'}

In [13]:
animals_col=animals.groupby(behavior_map, axis=1)

In [14]:
animals_col.sum()

        bad  good
Dog     1.0   2.0
Cat     5.0   0.0
Bird    9.0  18.0
Mouse  13.0  26.0

In [16]:
behav_series=Series(behavior_map)

behav_series

W    good
X     bad
Y    good
Z     bad
dtype: object

In [17]:
animals.groupby(behav_series, axis=1).count()

       bad  good
Dog      1     2
Cat      1     0
Bird     1     2
Mouse    1     2

In [18]:
animals

          W   X     Y   z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [19]:
animals.groupby(len).sum()

      W   X     Y   z
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15

In [20]:
keys=['A', 'B', 'A', 'B']

In [22]:
animals.groupby([len,keys]).max()

        W   X     Y   z
3 A   0.0   1   2.0   3
  B   NaN   5   NaN   7
4 A   8.0   9  10.0  11
5 B  12.0  13  14.0  15

In [24]:
hier_col=pd.MultiIndex.from_arrays([['NY','NY','SF', 'SF'],[1,2,3,4]],names=['City', 'sub_value'])

In [27]:
dframe_hr=DataFrame(np.arange(16).reshape(4,4),columns=hier_col)

In [28]:
dframe_hr=dframe_hr*100

In [29]:
dframe_hr

City         NY          SF
sub_value     1     2     3     4
0             0   100   200   300
1           400   500   600   700
2           800   900  1000  1100
3          1200  1300  1400  1500